         MACRO                                                          00010000
.*====================================================================* 00020001
.*  THIS MACRO FLAGS THE END OF THE HALT ENTRIES, AND GENERATES       * 00021001
.*  THE HOST ADDRESS TABLE.                                           * 00022001
.*====================================================================* 00024001
.*                                                                      00025001
&NAME    HOSTEND                                                        00030000
.*                                                                      00031001
.*====================================================================* 00031101
.*                                                                    * 00031201
.*====================================================================* 00031301
.*                                                                      00031401
         GBLA  &SVC,&HOSTNO,&CALLS(64)                                  00032007
         GBLC  &LUPFX(64)                                               00032101
         LCLC  &HADTENT                                                 00032205
.*                                                                      00032301
.*====================================================================* 00032401
.*                                                                    * 00032501
.*====================================================================* 00032601
.*                                                                      00032701
         AIF   (&HOSTNO GT 0).HOSTOK                                    00032801
         MNOTE 8,'NO VALID HOST MACROS SPECIFIED. GENERATION BYPASSED.' 00032901
         AGO   .MEND                                                    00033001
.HOSTOK  ANOP                                                           00033101
.*                                                                      00033201
         DC    A(0)                FLAG END OF HOST ALIAS TABLE.        00033306
         SPACE 1                                                        00033405
*********************************************************************** 00033505
*                        HOST ADDRESS TABLE                           * 00033605
*********************************************************************** 00033705
         SPACE 1                                                        00033805
.*                                                                      00033905
&LOOP#   SETA  0                                                        00034001
.LOOP    ANOP                                                           00034101
&LOOP#   SETA  &LOOP#+1                                                 00034204
&LU      SETC  '&LUPFX(&LOOP#)'                                         00034301
&HADTENT SETC  'HOST&LOOP#'                                             00034405
&HADTENT DC    H'&CALLS(&LOOP#)',CL6'&LU',&CALLS(&LOOP#).X'00'          00034508
         AIF   (&LOOP# LT &HOSTNO).LOOP                                 00034601
.*                                                                      00035001
.MEND    ANOP                                                           00036001
         MEND                                                           00040000